In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
from itertools import cycle, islice
%matplotlib inline

In [2]:
training_set = pd.read_csv('data/train.csv')
training_set.head(10)

,id,keyword,location,text,target
0,1,NaN,NaN,Our Deeds are the Reason of this #earthquake M...,1
1,4,NaN,NaN,Forest fire near La Ronge Sask. Canada,1
2,5,NaN,NaN,All residents asked to 'shelter in place' are ...,1
3,6,NaN,NaN,"13,000 people receive #wildfires evacuation or...",1
4,7,NaN,NaN,Just got sent this photo from Ruby #Alaska as ...,1
5,8,NaN,NaN,#RockyFire Update => California Hwy. 20 closed...,1
6,10,NaN,NaN,#flood #disaster Heavy rain causes flash flood...,1
7,13,NaN,NaN,I'm on top of the hill and I can see a fire in...,1
8,14,NaN,NaN,There's an emergency evacuation happening now ...,1
9,15,NaN,NaN,I'm afraid that the tornado is coming to our a...,1

In [3]:
training_set.describe()

                 id      target
count   7613.000000  7613.00000
mean    5441.934848     0.42966
std     3137.116090     0.49506
min        1.000000     0.00000
25%     2734.000000     0.00000
50%     5408.000000     0.00000
75%     8146.000000     1.00000
max    10873.000000     1.00000

In [4]:
#USA = United States = US lo consideramos como parte de la capital de estados unidos, Washington, D.C.
training_set['location'] = training_set['location'].apply(lambda x: 'Washington, D.C.' if x == 'US' else x)
training_set['location'] = training_set['location'].apply(lambda x: 'Washington, D.C.' if x == 'USA' else x)
training_set['location'] = training_set['location'].apply(lambda x: 'Washington, D.C.' if x == 'United States' else x)
training_set['location'] = training_set['location'].apply(lambda x: 'Washington, D.C.' if x == 'Washington, DC' else x)
training_set['location'] = training_set['location'].apply(lambda x: 'Washington, D.C.' if x == 'Washington' else x)
#United Kingdom = UK = Londres(capital)
training_set['location'] = training_set['location'].apply(lambda x: 'Londres' if x == 'UK' else x)
training_set['location'] = training_set['location'].apply(lambda x: 'Londres' if x == 'United Kingdom' else x)
training_set['location'] = training_set['location'].apply(lambda x: 'Londres' if x == 'England.' else x)
#London, England = London
training_set['location'] = training_set['location'].apply(lambda x: 'London' if x == 'London, England' else x)
training_set['location'] = training_set['location'].apply(lambda x: 'London' if x == 'London, UK' else x)
#New York = NYC = New York, NY = New York City
training_set['location'] = training_set['location'].apply(lambda x: 'New York' if x == 'NYC' else x)
training_set['location'] = training_set['location'].apply(lambda x: 'New York' if x == 'New York, NY' else x)
training_set['location'] = training_set['location'].apply(lambda x: 'New York' if x == 'New York City' else x)
#Los Angeles, CA = Los Angeles
training_set['location'] = training_set['location'].apply(lambda x: 'Los Angeles' if x == 'Los Angeles, CA' else x)
#Sacramento, CA = Sacramento
training_set['location'] = training_set['location'].apply(lambda x: 'Sacramento' if x == 'Sacramento, CA' else x)
#San Francisco, CA = San Francisco
training_set['location'] = training_set['location'].apply(lambda x: 'San Francisco' if x == 'San Francisco, CA' else x)
#California, USA = California
training_set['location'] = training_set['location'].apply(lambda x: 'California' if x == 'California, USA' else x)
training_set['location'] = training_set['location'].apply(lambda x: 'California' if x == 'California, United States' else x)
#Pennsylvania, USA = Pennsylvania
training_set['location'] = training_set['location'].apply(lambda x: 'Pennsylvania' if x == 'Pennsylvania, USA' else x)
#Chicago, IL = Chicago
training_set['location'] = training_set['location'].apply(lambda x: 'Chicago' if x == 'Chicago, IL' else x)
#Nashville, TN = Nashville
training_set['location'] = training_set['location'].apply(lambda x: 'Nashville' if x == 'Nashville, TN' else x)
#Denver, Colorado = Colorado
training_set['location'] = training_set['location'].apply(lambda x: 'Colorado' if x == 'Denver, Colorado' else x)
training_set['location'] = training_set['location'].apply(lambda x: 'Colorado' if x == 'Denver' else x)
#San Diego, CA
training_set['location'] = training_set['location'].apply(lambda x: 'San Diego' if x == 'San Diego, CA' else x)
#Morioh, Japan = Morioh
training_set['location'] = training_set['location'].apply(lambda x: 'Morioh' if x == 'Morioh, Japan' else x)
#Memphis, TN = Memphis
training_set['location'] = training_set['location'].apply(lambda x: 'Memphis' if x == 'Memphis, TN' else x)
#Dallas, TX = Dallas
training_set['location'] = training_set['location'].apply(lambda x: 'Dallas' if x == 'Dallas, TX' else x)
#Seattle, Washington = Seattle
training_set['location'] = training_set['location'].apply(lambda x: 'Seattle' if x == 'Seattle, Washington' else x)
#Nigeria = Abuya (capital)
training_set['location'] = training_set['location'].apply(lambda x: 'Abuya' if x == 'Nigeria' else x)
#Canada = Ottawa (capital)
training_set['location'] = training_set['location'].apply(lambda x: 'Ottawa' if x == 'Canada' else x)
#Indonesia = Yakarta (capital) = Jakarta/Kuala Lumpur/S'pore
training_set['location'] = training_set['location'].apply(lambda x: 'Yakarta' if x == 'Indonesia' else x)
training_set['location'] = training_set['location'].apply(lambda x: 'Yakarta' if x == 'Jakarta/Kuala Lumpur/S\'pore' else x)
#Kenya = Nairobi (capital)
training_set['location'] = training_set['location'].apply(lambda x: 'Nairobi' if x == 'Kenya' else x)
#Australia = Canberra (capital)
training_set['location'] = training_set['location'].apply(lambda x: 'Canberra' if x == 'Australia' else x)
#South Africa = Pretoria (capital)
training_set['location'] = training_set['location'].apply(lambda x: 'Pretoria' if x == 'South Africa' else x)
training_set['location'] = training_set['location'].apply(lambda x: 'Pretoria' if x == 'AFRICA' else x)
#India = Nueva Delhi (capital)
training_set['location'] = training_set['location'].apply(lambda x: 'Nueva Delhi' if x == 'India' else x)

In [5]:
#limpiamos los que no son regiones
training_set = training_set.loc[(~training_set.location.str.contains('Earth', na=False))
                                & (~training_set.location.str.contains('Everywhere', na=False))
                                & (~training_set.location.str.contains('ss', na=False))
                                & (~training_set.location.str.contains('Worldwide', na=False))
                                & (~training_set.location.str.contains('304', na=False))
                                & (~training_set.location.str.contains('World Wide!!', na=False))
                                & (~training_set.location.str.contains('Nowhere. Everywhere.', na=False))
                                & (~training_set.location.str.contains('Happily Married with 2 kids', na=False))
                                & (~training_set.location.str.contains('Pedophile hunting ground', na=False))
                                & (~training_set.location.str.contains('milky way', na=False))
                                & (~training_set.location.str.contains('Live On Webcam', na=False))
                                & (~training_set.location.str.contains('Est. September 2012 - Bristol', na=False))
                                & (~training_set.location.str.contains('Road to the Billionaires Club', na=False))
                                & (~training_set.location.str.contains('Buy Give Me My Money', na=False))
                                & (~training_set.location.str.contains('Narnia', na=False))
                                & (~training_set.location.str.contains('Twitter Lockout in progress', na=False))
                                & (~training_set.location.str.contains('hollywoodland', na=False))
                               ]

In [6]:
location_tweets = training_set.loc[:,['location', 'target']]
location_tweets = location_tweets.loc[pd.notna(location_tweets.location) & pd.notnull(location_tweets.location)]
location_tweets.head(10)

                     location  target
31                 Birmingham       1
33                   Pretoria       1
34           Philadelphia, PA       0
35                     London       0
36                   Pretoria       0
39             Paranaque City       0
46  GREENSBORO,NORTH CAROLINA       1
49                    Londres       0
50   Sheffield Township, Ohio       1
51                Nueva Delhi       1

In [7]:
location_tweets = location_tweets.groupby(['location', 'target']).size().reset_index()
location_tweets.rename({0:'count_location'}, axis=1, inplace=True)
location_tweets.describe()

            target  count_location
count  3471.000000     3471.000000
mean      0.414578        1.397580
std       0.492720        3.221565
min       0.000000        1.000000
25%       0.000000        1.000000
50%       0.000000        1.000000
75%       1.000000        1.000000
max       1.000000      126.000000

In [8]:
location_tweets.sort_values(by='count_location', ascending=False, inplace=True)
location_tweets.head(10)

              location  target  count_location
2906  Washington, D.C.       1             126
1900          New York       0              77
2905  Washington, D.C.       0              73
1555            London       0              43
1901          New York       1              31
1581       Los Angeles       0              24
235              Abuya       1              22
601         California       0              22
1574           Londres       0              22
1556            London       1              22

In [9]:
location_tweets_reales = location_tweets.loc[location_tweets.target == 1]
location_tweets_fakes = location_tweets.loc[location_tweets.target == 0]

In [10]:
location_tweets_reales.describe()

       target  count_location
count  1439.0     1439.000000
mean      1.0        1.466296
std       0.0        3.734599
min       1.0        1.000000
25%       1.0        1.000000
50%       1.0        1.000000
75%       1.0        1.000000
max       1.0      126.000000

In [11]:
location_tweets_fakes.describe()

       target  count_location
count  2032.0     2032.000000
mean      0.0        1.348917
std       0.0        2.801984
min       0.0        1.000000
25%       0.0        1.000000
50%       0.0        1.000000
75%       0.0        1.000000
max       0.0       77.000000

In [12]:
location_tweets_reales.head(20)

              location  target  count_location
2906  Washington, D.C.       1             126
1901          New York       1              31
235              Abuya       1              22
1556            London       1              22
1575           Londres       1              20
1992       Nueva Delhi       1              20
1783            Mumbai       1              19
602         California       1              16
1582       Los Angeles       1              15
2061            Ottawa       1              13
2353     San Francisco       1              13
676            Chicago       1              13
3012           Yakarta       1              12
2331        Sacramento       1              11
729           Colorado       1               9
617           Canberra       1               9
1857         Nashville       1               8
1708           Memphis       1               7
1842           Nairobi       1               7
2709           Toronto       1               7

In [13]:
location_tweets_fakes.head(20)

              location  target  count_location
1900          New York       0              77
2905  Washington, D.C.       0              73
1555            London       0              43
1581       Los Angeles       0              24
601         California       0              22
1574           Londres       0              22
2060            Ottawa       0              16
1841           Nairobi       0              16
675            Chicago       0              16
2352     San Francisco       0              12
989            Florida       0              11
2402           Seattle       0              11
2130      Pennsylvania       0              10
616           Canberra       0               9
2213          Pretoria       0               8
2345         San Diego       0               8
2620             Texas       0               7
1656        Manchester       0               7
728           Colorado       0               6
1324           Ireland       0               6

In [14]:
keyword_tweets = training_set.loc[:,['keyword', 'target']]
keyword_tweets = keyword_tweets.loc[pd.notna(keyword_tweets.keyword) & pd.notnull(keyword_tweets.keyword)]
keyword_tweets.head(20)

   keyword  target
31  ablaze       1
33  ablaze       1
34  ablaze       0
35  ablaze       0
36  ablaze       0
38  ablaze       1
39  ablaze       0
41  ablaze       0
43  ablaze       0
44  ablaze       0
45  ablaze       0
46  ablaze       1
47  ablaze       0
49  ablaze       0
50  ablaze       1
51  ablaze       1
52  ablaze       0
53  ablaze       1
54  ablaze       0
55  ablaze       1

In [15]:
keyword_tweets = keyword_tweets.groupby(['keyword', 'target']).size().reset_index()
keyword_tweets.rename({0:'count_keyword'}, axis=1, inplace=True)
keyword_tweets.describe()

           target  count_keyword
count  438.000000     438.000000
mean     0.502283      16.719178
std      0.500567       9.643112
min      0.000000       1.000000
25%      0.000000       8.000000
50%      1.000000      16.000000
75%      1.000000      25.000000
max      1.000000      40.000000

In [16]:
keyword_tweets.sort_values(by='count_keyword', ascending=False, inplace=True)
keyword_tweets.head(40)

               keyword  target  count_keyword
57         body%20bags       0             40
304           outbreak       1             39
435           wreckage       1             39
138         derailment       1             39
123             debris       1             37
408            typhoon       1             37
302        oil%20spill       1             37
337               ruin       0             36
436            wrecked       0             36
124             deluge       0             36
209               fear       0             35
235               harm       0             35
405            twister       0             34
193            explode       0             33
15          armageddon       0             33
35               blaze       0             33
399        traumatised       0             33
45            blizzard       0             33
243           hellfire       0             32
49              bloody       0             32
351            sinking       0             32
343          screaming       0             32
353              siren       0             32
330           rescuers       1             32
372  suicide%20bombing       1             32
109             curfew       0             31
322              razed       1             31
53          body%20bag       0             31
309          panicking       0             31
409           upheaval       0             31
190          evacuated       1             31
41           blew%20up       0             31
95             collide       0             31
37             blazing       0             31
43              blight       0             30
363          stretcher       0             30
307              panic       0             30
357              smoke       0             30
345            screams       0             30
39            bleeding       0             30

In [17]:
location_keyword_tweets = training_set.loc[:,['location', 'keyword', 'target']]
location_keyword_tweets = location_keyword_tweets.loc[pd.notna(location_keyword_tweets.location) & pd.notnull(location_keyword_tweets.location) & pd.notna(location_keyword_tweets.keyword) & pd.notnull(location_keyword_tweets.keyword)]
location_keyword_tweets.head(20)

                        location keyword  target
31                    Birmingham  ablaze       1
33                      Pretoria  ablaze       1
34              Philadelphia, PA  ablaze       0
35                        London  ablaze       0
36                      Pretoria  ablaze       0
39                Paranaque City  ablaze       0
46     GREENSBORO,NORTH CAROLINA  ablaze       1
49                       Londres  ablaze       0
50      Sheffield Township, Ohio  ablaze       1
51                   Nueva Delhi  ablaze       1
52                      Barbados  ablaze       0
53                       Anaheim  ablaze       1
54                         Abuja  ablaze       0
55              Washington, D.C.  ablaze       1
56                      Pretoria  ablaze       1
57             Sao Paulo, Brazil  ablaze       0
59  Edmonton, Alberta - Treaty 6  ablaze       1
61              Inang Pamantasan  ablaze       0
63                   Concord, CA  ablaze       1
64                   Calgary, AB  ablaze       0

In [18]:
location_keyword_tweets = location_keyword_tweets.groupby(['location', 'keyword', 'target']).size().reset_index()
location_keyword_tweets.rename({0:'count'}, axis=1, inplace=True)
location_keyword_tweets.describe()

            target        count
count  4496.000000  4496.000000
mean      0.426824     1.078959
std       0.494671     0.556680
min       0.000000     1.000000
25%       0.000000     1.000000
50%       0.000000     1.000000
75%       1.000000     1.000000
max       1.000000    20.000000

In [19]:
location_keyword_tweets.sort_values(by='count', ascending=False, inplace=True)
location_keyword_tweets.head(20)

              location               keyword  target  count
3853  Washington, D.C.             sandstorm       1     20
2338           Nairobi           loud%20bang       0     13
2429          New York            body%20bag       0     11
2460          New York                 flood       0     11
2265            Mumbai              wreckage       1     10
266              Abuya        suicide%20bomb       1      9
2596       Nueva Delhi            derailment       1      7
3799  Washington, D.C.              derailed       1      7
3801  Washington, D.C.             destroyed       0      7
2246            Morioh              detonate       0      6
3827  Washington, D.C.             hazardous       1      5
915           Colorado              hellfire       0      5
3825  Washington, D.C.                  hail       1      5
3822  Washington, D.C.                 flood       1      5
3871  Washington, D.C.               wounded       1      5
703         California            armageddon       0      4
3165           Seattle  chemical%20emergency       0      4
912           Colorado             collision       1      4
3043        Sacramento             collision       1      4
2453          New York             explosion       0      4